""" 

    머신러닝 라이브러리의 종류

        TenserFlow
        PyTorch
        Caffe2
        theano



    알고리즘의 종류

        NeuralNetwork(딥러닝 용)
        SVM
        KNN
        Random Forest
        Decision Tree



    지도학습의 종류

        회귀
        분류

    

    지도학습의 흐름

        1. 과거의 데이터
            
            패턴이 있는 데이터
                원인과 결과가 있는 데이터(독립변수, 종속변수)

        2. 모델의 구조 만들기

            데이터 형태에 알맞은 모델 생성
                독립변수와 종속변수 갯수에 알맞은 모델 생성(변수의 종류도?)

        3. 데이터로 모델을 학습(FIT)

            데이터를 통해 모델을 수정해나가는 과정
                데이터의 패턴을 통한 모델 정확도 향상 작업

        4. 모델 사용

        

    실습 환경

        Google - Colaboratory

            주피터 노트를 온라인으로 사용할 수 있도록 하는 플랫폼

        사용언어 - 파이썬    

 """